app/controllers/friends_controller.rb

INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twitter", "created_at", "updated_at", "user_id") VALUES ('Martins', 'Berzins', 'm.berzins09@gmail.com', '26591821', '@Bemas9', '2025-11-09 14:16:19.548380', '2025-11-09 14:16:19.548380', 2) RETURNING "id"
---
  def create
    #@friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)

    respond_to do |format|
      if @friend.save

DELETE FROM "friends" WHERE "friends"."id" = 3
---
  def destroy
    @friend.destroy!

SELECT "friends".* FROM "friends" WHERE "friends"."id" = 1 LIMIT 1
---
  def correct_user
    @friend = current_user.friends.find_by(id: params[:id])

SELECT "friends".* FROM "friends" WHERE "friends"."id" = 9 LIMIT 1
---
    def set_friend
      @friend = Friend.find(params.expect(:id))